# Project 1, Part 1, Sales Related Queries

University of California, Berkeley

Master of Information and Data Science (MIDS) program

w205 - Fundamentals of Data Engineering

Student: Lee Gary

Year: 2020

Semester: Fall

Section: w205

# Included Modules and Packages

Code cell containing your includes for modules and packages

In [2]:
import math
import numpy as np
import pandas as pd

import psycopg2

# Supporting code

Code cells containing any supporting code, such as connecting to the database, any functions, etc.  Remember you can use any code from the labs.

In [3]:
#
# function to run a select query and return rows in a pandas dataframe
# pandas puts all numeric values from postgres to float
# if it will fit in an integer, change it to integer
#

def my_select_query_pandas(query, rollback_before_flag, rollback_after_flag):
    "function to run a select query and return rows in a pandas dataframe"
    
    if rollback_before_flag:
        connection.rollback()
    
    df = pd.read_sql_query(query, connection)
    
    if rollback_after_flag:
        connection.rollback()
    
    # fix the float columns that really should be integers
    
    for column in df:
    
        if df[column].dtype == "float64":

            fraction_flag = False

            for value in df[column].values:
                
                if not np.isnan(value):
                    if value - math.floor(value) != 0:
                        fraction_flag = True

            if not fraction_flag:
                df[column] = df[column].astype('Int64')
    
    return(df)

In [4]:
connection = psycopg2.connect(
    user = "postgres",
    password = "ucb",
    host = "postgres",
    port = "5432",
    database = "postgres"
)

# 1.1.1 Total sales as a dollar amount, total number of sales, average dollar amount per sale


You will be using the same database as used in the SQL labs in week 2.  Remember to review the data model in ERD format and the data dictionary for more information about the structure of the database.

Each record in the sales table is an individual sale, and the total_amount column is the total amount for that individual sale.


Write 1 and only 1 query.  Note that the query may have as many subqueries, including with clauses, as you wish.  

Name column headers exactly as shown in the example below. 

Format data exactly as shown in the example below.

Ensure that when you check this Juptyer Notebook into GitHub that the query results in the Pandas dataframe are clearly visible in GitHub.


The query should return only 1 row into a Pandas dataframe and should look similar to this: 

||total_sales_dollars|total_sales_million_dollars|total_number_of_sales|average_dollar_amount_per_sale|
|---|---|---|---|---|
|0|98739408|98.7|1537617|64.22|

In [18]:
rollback_before_flag = True
rollback_after_flag = True

query = """


select 
  sum(total_amount) total_sales_dollars
, (sum(total_amount)/1000000)::numeric(4,1) total_sales_million_dollars
, count(sale_id) total_number_of_sales
, avg(total_amount)::numeric(4,2) average_dollar_amount_per_sale
from sales

"""

df = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)
df

,total_sales_dollars,total_sales_million_dollars,total_number_of_sales,average_dollar_amount_per_sale
0,98739408,98.7,1537617,64.22

# 1.1.2 Total sales as a dollar amount, total number of sales, average dollar amount per sale by store

You will be using the same database as used in the SQL labs in week 2.  Remember to review the data model in ERD format and the data dictionary for more information about the structure of the database.

Each record in the sales table is an individual sale, and the total_amount column is the total amount for that individual sale.

For store name use the store's city.

Sort by store name in alphabetical order.

Write 1 and only 1 query.  Note that the query may have as many subqueries, including with clauses, as you wish.  

Name column headers exactly as shown in the example below. 

Format data exactly as shown in the example below.

Sort data exactly as shown in the example below.

Ensure that when you check this Juptyer Notebook into GitHub that the query results in the Pandas dataframe are clearly visible in GitHub.



The query should return 5 rows into a Pandas dataframe. The first and last rows should look similar to this: 

||store_name|total_sales_dollars|total_sales_million_dollars|total_number_of_sales|average_dollar_amount_per_sale|
|---|---|---|---|---|---|
|0|Berkeley|25041060|25.0|390375|64.15|
|...|...|...|...|...|...|
|4|Seattle|22024512|22.0|342327|64.34|

In [23]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select b.city as store_name
, sum(total_amount) as total_sales_dollars
, (sum(total_amount)/1000000)::numeric(4,1) as total_sales_million_dollars
, count(sale_id) as total_number_of_sales
, avg(total_amount)::numeric(4,2) as average_dollar_amount_per_sale
from sales a 
inner join stores b 
    on a.store_id = b.store_id
group by b.city 
order by b.city 
"""

df = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)
df

,store_name,total_sales_dollars,total_sales_million_dollars,total_number_of_sales,average_dollar_amount_per_sale
0,Berkeley,25041060,25.0,390375,64.15
1,Dallas,19408260,19.4,302120,64.24
2,Miami,17692404,17.7,275074,64.32
3,Nashville,14573172,14.6,227721,64.00
4,Seattle,22024512,22.0,342327,64.34

# 1.1.3 Total sales as a dollar amount, total number of sales, average dollar amount per sale by month

You will be using the same database as used in the SQL labs in week 2.  Remember to review the data model in ERD format and the data dictionary for more information about the structure of the database.

Each record in the sales table is an individual sale, and the total_amount column is the total amount for that individual sale.

Derive the month_number (1 = January) and the month from the sale_date.

Sort by month_number.

Write 1 and only 1 query.  Note that the query may have as many subqueries, including with clauses, as you wish.  

Name column headers exactly as shown in the example below. 

Format data exactly as shown in the example below.

Sort data exactly as shown in the example below.

Ensure that when you check this Juptyer Notebook into GitHub that the query results in the Pandas dataframe are clearly visible in GitHub.

The query should return 12 rows into a Pandas dataframe. The first and last rows should look similar to this: 

||month_number|month|total_sales_dollars|total_sales_million_dollars|total_number_of_sales|average_dollar_amount_per_sale|
|---|---|---|---|---|---|---|
|0|1|January  |7803828|7.8|121955|63.99|
|...|...|...|...|...|...|...|
|11|12|December |8340420|8.3|130209|64.05|

In [68]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select 
a.month_number
, a.month
, sum(a.total_amount) as total_sales_dollars
, (sum(a.total_amount)/1000000)::numeric(4,1) as total_sales_million_dollars
, count(a.sale_id) as total_number_of_sales
, avg(a.total_amount)::numeric(4,2) as average_dollar_amount_per_sale
from (
    select extract(month from sale_date) as month_number  
    , to_char(sale_date, 'Month') as month
    , total_amount
    , sale_id
    from sales 
) a
group by a.month, a.month_number
order by month_number

"""

df = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)
df

,month_number,month,total_sales_dollars,total_sales_million_dollars,total_number_of_sales,average_dollar_amount_per_sale
0,1,January,7803828,7.8,121955,63.99
1,2,February,7574280,7.6,117984,64.20
2,3,March,8779620,8.8,136653,64.25
3,4,April,8251284,8.3,128155,64.39
4,5,May,7977840,8.0,124380,64.14
5,6,June,8124108,8.1,126248,64.35
6,7,July,7993044,8.0,124290,64.31
7,8,August,9029808,9.0,140467,64.28
8,9,September,7578960,7.6,117974,64.24
9,10,October,8895108,8.9,138731,64.12
10,11,November,8391108,8.4,130571,64.26
11,12,December,8340420,8.3,130209,64.05

# 1.1.4 Total sales as a dollar amount, total number of sales, average dollar amount per sale by store and month

You will be using the same database as used in the SQL labs in week 2.  Remember to review the data model in ERD format and the data dictionary for more information about the structure of the database.

Each record in the sales table is an individual sale, and the total_amount column is the total amount for that individual sale.

For store name use the store's city.

Derive the month_number (1 = January) and the month from the sale_date.

Sort by store name in alphabetical order then by month_number.

Write 1 and only 1 query.  Note that the query may have as many subqueries, including with clauses, as you wish.  

Name column headers exactly as shown in the example below. 

Format data exactly as shown in the example below.

Sort data exactly as shown in the example below.

Ensure that when you check this Juptyer Notebook into GitHub that the query results in the Pandas dataframe are clearly visible in GitHub.

The query should return 60 rows into a Pandas dataframe. The first and last rows should look similar to this: 

||store_name|month_number|month|total_sales_dollars|total_sales_million_dollars|total_number_of_sales|average_dollar_amount_per_sale|
|---|---|---|---|---|---|---|---|
|0|Berkeley|1|January  |1988904|2.0|31045|64.07|
|...|...|...|...|...|...|...|...|
|59|Seattle|12|December |1876056|1.9|29136|64.39|

In [72]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select 
store_name
,a.month_number
, a.month
, sum(a.total_amount) as total_sales_dollars
, (sum(a.total_amount)/1000000)::numeric(4,1) as total_sales_million_dollars
, count(a.sale_id) as total_number_of_sales
, avg(a.total_amount)::numeric(4,2) as average_dollar_amount_per_sale
from (
    select 
    b.city as store_name
    , extract(month from sale_date) as month_number  
    , to_char(sale_date, 'Month') as month
    , total_amount
    , sale_id
    from sales a
    inner join stores b 
    on a.store_id = b.store_id
) a
group by store_name, a.month, a.month_number
order by month_number, store_name

"""

df = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)
df

,store_name,month_number,month,total_sales_dollars,total_sales_million_dollars,total_number_of_sales,average_dollar_amount_per_sale
0,Berkeley,1,January,1988904,2.0,31045,64.07
1,Dallas,1,January,1532232,1.5,23908,64.09
2,Miami,1,January,1391916,1.4,21740,64.03
3,Nashville,1,January,1147716,1.1,18058,63.56
4,Seattle,1,January,1743060,1.7,27204,64.07
5,Berkeley,2,February,1930272,1.9,30062,64.21
6,Dallas,2,February,1487076,1.5,23170,64.18
7,Miami,2,February,1352136,1.4,21075,64.16
8,Nashville,2,February,1114788,1.1,17414,64.02
9,Seattle,2,February,1690008,1.7,26263,64.35
10,Berkeley,3,March,2224500,2.2,34704,64.10
11,Dallas,3,March,1729404,1.7,27033,63.97
12,Miami,3,March,1579920,1.6,24447,64.63
13,Nashville,3,March,1292100,1.3,20225,63.89
14,Seattle,3,March,1953696,2.0,30244,64.60
15,Berkeley,4,April,2092056,2.1,32589,64.20
16,Dallas,4,April,1626900,1.6,25135,64.73
17,Miami,4,April,1482600,1.5,22950,64.60
18,Nashville,4,April,1213176,1.2,19000,63.85
19,Seattle,4,April,1836552,1.8,28481,64.48
20,Berkeley,5,May,2019264,2.0,31485,64.13
21,Dallas,5,May,1567404,1.6,24411,64.21
22,Miami,5,May,1430916,1.4,22258,64.29
23,Nashville,5,May,1183092,1.2,18514,63.90
24,Seattle,5,May,1777164,1.8,27712,64.13
25,Berkeley,6,June,2065140,2.1,32153,64.23
26,Dallas,6,June,1596660,1.6,24786,64.42
27,Miami,6,June,1455804,1.5,22557,64.54
28,Nashville,6,June,1215228,1.2,18782,64.70
29,Seattle,6,June,1791276,1.8,27970,64.04
30,Berkeley,7,July,2034708,2.0,31582,64.43
31,Dallas,7,July,1569072,1.6,24400,64.31
32,Miami,7,July,1431048,1.4,22181,64.52
33,Nashville,7,July,1177284,1.2,18389,64.02
34,Seattle,7,July,1780932,1.8,27738,64.21
35,Berkeley,8,August,2286732,2.3,35676,64.10
36,Dallas,8,August,1772712,1.8,27569,64.30
37,Miami,8,August,1632324,1.6,25227,64.71
38,Nashville,8,August,1320444,1.3,20720,63.73
39,Seattle,8,August,2017596,2.0,31275,64.51
40,Berkeley,9,September,1922256,1.9,29876,64.34
41,Dallas,9,September,1489092,1.5,23241,64.07
42,Miami,9,September,1352496,1.4,21019,64.35
43,Nashville,9,September,1116972,1.1,17526,63.73
44,Seattle,9,September,1698144,1.7,26312,64.54
45,Berkeley,10,October,2248008,2.2,35199,63.87
46,Dallas,10,October,1754220,1.8,27307,64.24
47,Miami,10,October,1590708,1.6,24820,64.09
48,Nashville,10,October,1317600,1.3,20496,64.29
49,Seattle,10,October,1984572,2.0,30909,64.21
50,Berkeley,11,November,2127384,2.1,33083,64.30
51,Dallas,11,November,1646436,1.6,25614,64.28
52,Miami,11,November,1494468,1.5,23385,63.91
53,Nashville,11,November,1247364,1.2,19406,64.28
54,Seattle,11,November,1875456,1.9,29083,64.49
55,Berkeley,12,December,2101836,2.1,32921,63.84
56,Dallas,12,December,1637052,1.6,25546,64.08
57,Miami,12,December,1498068,1.5,23415,63.98
58,Nashville,12,December,1227408,1.2,19191,63.96
59,Seattle,12,December,1876056,1.9,29136,64.39

# 1.1.5 Total sales as a dollar amount, total number of sales, average dollar amount per sale by day of week

You will be using the same database as used in the SQL labs in week 2.  Remember to review the data model in ERD format and the data dictionary for more information about the structure of the database.

Each record in the sales table is an individual sale, and the total_amount column is the total amount for that individual sale.

Derive the dow (0 = Sunday) and the day_of_week from the sale_date.

Sort by dow.

Write 1 and only 1 query.  Note that the query may have as many subqueries, including with clauses, as you wish.  

Name column headers exactly as shown in the example below. 

Format data exactly as shown in the example below.

Sort data exactly as shown in the example below.

Ensure that when you check this Juptyer Notebook into GitHub that the query results in the Pandas dataframe are clearly visible in GitHub.

The query should return 7 rows into a Pandas dataframe. The first and last rows should look similar to this (note that markdown drops the trailing zero while Pandas does not - this is fine): 

||dow|day_of_week|total_sales_dollars|total_sales_million_dollars|total_number_of_sales|average_dollar_amount_per_sale|
|---|---|---|---|---|---|---|
|0|0|Sunday   |18589068|18.6|289869|64.13|
|...|...|...|...|...|...|...|
|6|6|Saturday |19421460|19.4|302055|64.3|

In [76]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select 
a.dow
, a.day_of_week
, sum(a.total_amount) as total_sales_dollars
, (sum(a.total_amount)/1000000)::numeric(4,1) as total_sales_million_dollars
, count(a.sale_id) as total_number_of_sales
, avg(a.total_amount)::numeric(4,2) as average_dollar_amount_per_sale
from (
    select extract(dow from sale_date) as dow  
    , to_char(sale_date, 'Day') as day_of_week
    , total_amount
    , sale_id
    from sales 
) a
group by a.dow
order by a.dow

"""

df = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)
df

,dow,day_of_week,total_sales_dollars,total_sales_million_dollars,total_number_of_sales,average_dollar_amount_per_sale
0,0,Sunday,18589068,18.6,289869,64.13
1,1,Monday,13167720,13.2,204909,64.26
2,2,Tuesday,6895332,6.9,107488,64.15
3,3,Wednesday,13952556,14.0,217288,64.21
4,4,Thursday,13834644,13.8,214969,64.36
5,5,Friday,12878628,12.9,201039,64.06
6,6,Saturday,19421460,19.4,302055,64.30

# 1.1.6 Total sales as a dollar amount, total number of sales, average dollar amount per sale by store and day of week


You will be using the same database as used in the SQL labs in week 2.  Remember to review the data model in ERD format and the data dictionary for more information about the structure of the database.

Each record in the sales table is an individual sale, and the total_amount column is the total amount for that individual sale.

For store name use the store's city.

Derive the dow (0 = Sunday) and the day_of_week from the sale_date.

Sort by store name, then by dow.

Write 1 and only 1 query.  Note that the query may have as many subqueries, including with clauses, as you wish.  

Name column headers exactly as shown in the example below. 

Format data exactly as shown in the example below.

Sort data exactly as shown in the example below.

Ensure that when you check this Juptyer Notebook into GitHub that the query results in the Pandas dataframe are clearly visible in GitHub.


The query should return 35 rows into a Pandas dataframe. The first and last rows should look similar to this: 

||store_name|dow|day_of_week|total_sales_dollars|total_sales_million_dollars|total_number_of_sales|average_dollar_amount_per_sale|
|---|---|---|---|---|---|---|---|
|0|Berkeley|0|Sunday   |4694640|4.7|73481|63.89|
|...|...|...|...|...|...|...|...|
|34|Seattle|6|Saturday |4336704|4.3|67220|64.52|

In [83]:
rollback_before_flag = True
rollback_after_flag = True

query = """

select 
a.store_name
, a.dow
, a.day_of_week
, sum(a.total_amount) as total_sales_dollars
, (sum(a.total_amount)/1000000)::numeric(4,1) as total_sales_million_dollars
, count(a.sale_id) as total_number_of_sales
, avg(a.total_amount)::numeric(4,2) as average_dollar_amount_per_sale
from (

    select 
    b.city as store_name
    , extract(dow from sale_date) as dow  
    , to_char(sale_date, 'Day') as day_of_week
    , total_amount
    , sale_id
    from sales a
    inner join stores b 
        on a.store_id = b.store_id
) a
group by a.store_name, a.dow, a.day_of_week
order by a.dow, store_name

"""

df = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)
df

,store_name,dow,day_of_week,total_sales_dollars,total_sales_million_dollars,total_number_of_sales,average_dollar_amount_per_sale
0,Berkeley,0,Sunday,4694640,4.7,73481,63.89
1,Dallas,0,Sunday,3650748,3.7,56896,64.17
2,Miami,0,Sunday,3331680,3.3,51859,64.24
3,Nashville,0,Sunday,2743644,2.7,42896,63.96
4,Seattle,0,Sunday,4168356,4.2,64737,64.39
5,Berkeley,1,Monday,3340116,3.3,52072,64.14
6,Dallas,1,Monday,2602980,2.6,40280,64.62
7,Miami,1,Monday,2364624,2.4,36713,64.41
8,Nashville,1,Monday,1946532,1.9,30382,64.07
9,Seattle,1,Monday,2913468,2.9,45462,64.09
10,Berkeley,2,Tuesday,1752036,1.8,27281,64.22
11,Dallas,2,Tuesday,1352760,1.4,21137,64.00
12,Miami,2,Tuesday,1232220,1.2,19143,64.37
13,Nashville,2,Tuesday,1015344,1.0,15911,63.81
14,Seattle,2,Tuesday,1542972,1.5,24016,64.25
15,Berkeley,3,Wednesday,3546144,3.5,55216,64.22
16,Dallas,3,Wednesday,2749956,2.7,42798,64.25
17,Miami,3,Wednesday,2484180,2.5,38831,63.97
18,Nashville,3,Wednesday,2061324,2.1,32169,64.08
19,Seattle,3,Wednesday,3110952,3.1,48274,64.44
20,Berkeley,4,Thursday,3507660,3.5,54561,64.29
21,Dallas,4,Thursday,2722356,2.7,42207,64.50
22,Miami,4,Thursday,2478768,2.5,38441,64.48
23,Nashville,4,Thursday,2031072,2.0,31818,63.83
24,Seattle,4,Thursday,3094788,3.1,47942,64.55
25,Berkeley,5,Friday,3273240,3.3,51071,64.09
26,Dallas,5,Friday,2517408,2.5,39463,63.79
27,Miami,5,Friday,2321196,2.3,35983,64.51
28,Nashville,5,Friday,1909512,1.9,29846,63.98
29,Seattle,5,Friday,2857272,2.9,44676,63.96
30,Berkeley,6,Saturday,4927224,4.9,76693,64.25
31,Dallas,6,Saturday,3812052,3.8,59339,64.24
32,Miami,6,Saturday,3479736,3.5,54104,64.32
33,Nashville,6,Saturday,2865744,2.9,44699,64.11
34,Seattle,6,Saturday,4336704,4.3,67220,64.52